<template>
  <div class="task">
    <h2 class="task__title">Одностраничное приложение, эмулирующее работу лифтовой системы.</h2>
    <p>
      При первом входе все лифты находятся на&nbsp;1-м этаже в&nbsp;состоянии покоя (свободен).
    </p>
    <p>
      При нажатии на кнопку вызова лифт обрабатывает этот вызов в соответствии со следующими сценариями:
      <ol>
        <li>Если вызов осуществляется с&nbsp;этажа, на&nbsp;котором лифта нет – свободный лифт
          начинает движение к&nbsp;выбранному этажу со&nbsp;скоростью 1&nbsp;этаж в&nbsp;секунду. Достигнув нужного этажа лифт 3 секунды 
          «отдыхает»&nbsp;-&nbsp;индикацию этого состояния реализована с&nbsp;помощью мигания.
          После этого лифт снова переходит в&nbsp;состояние покоя и готов обработать
          следующий вызов.
        </li>
        <li>
          Если в&nbsp;момент движения лифта осуществить вызов на&nbsp;другой этаж – этот
          вызов должен добавиться в&nbsp;очередь вызовов. Вызовы должны обрабатываться последовательно.
        </li>
        <li>
          Вызов пропускается в&nbsp;случаях, если:
          <ul>
            <li>лифт уже находится на&nbsp;выбранном этаже в&nbsp;состоянии покоя;</li>
            <li>лифт уже находится в&nbsp;процессе обработки такого вызова (находится в&nbsp;движении к&nbsp;выбранному этажу);</li>
            <li>в&nbsp;очереди вызовов уже есть выбранный этаж;</li>
          </ul>
        </li>
        <li>
          Добавлено табло индикации на&nbsp;кабине лифта, на&nbsp;котором в&nbsp;процессе движения будет отображаться 
          направление движения и&nbsp;целевой этаж
        </li>
        <li>Добавлена индикация кнопок вызова на&nbsp;этажах (смену цвета) в&nbsp;случае, если:
          <ul>
            <li>лифт уже находится в&nbsp;процессе обработки такого вызова (находится в&nbsp;движении к&nbsp;выбранному этажу)</li>
            <li>в&nbsp;очереди вызовов уже есть выбранный этаж</li>
          </ul>
        </li>
        <li>Добавлено сохранение состояния приложения (позиция лифта, очередь вызовов и т.д.) при&nbsp;перезагрузке
          страницы – после перезагрузки приложение возобновляет работу с&nbsp;сохраненного состояния.</li>
      </ol>
    </p>

    <p>Для варианта с&nbsp;несколькими лифтами возможно менять количество лифтов/этажей в&nbsp;конфигурационном файле.
    При наличии двух и более свободных лифтов вызов обрабатывает лифт, наиболее близко расположенный к&nbsp;целевому этажу.
    </p>

  </div>

</template>

<style scoped>
.task {
  max-width: 900px;
  margin: 2rem;
}

.task__title {
  font-size: 1.5rem;
  font-weight: 500;
}

p {
  margin: 1rem 0;

}
</style>